Ramesh/task/app/controllers/posts_controller.rb

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
UPDATE `posts` SET `updated_at` = '2016-01-12 06:13:37', `clickcount` = 16 WHERE `id` = 1
---
  def show
    @post = Post.find(params[:id])
    @post.clickcount = @post.clickcount + 1
    @post.save

INSERT INTO `posts` (`countryname`, `description`, `clickcount`, `created_at`, `updated_at`) VALUES('India', 'The earliest authenticated human remains in South Asia date to about 30,000 years ago.[32] Nearly contemporaneous Mesolithic rock art sites have been found in many parts of the Indian subcontinent, including at the Bhimbetka rock shelters in Madhya Pradesh', 0, '2016-01-06 11:53:03', '2016-01-06 11:53:03')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
UPDATE `posts` SET `clickcount` = -1, `updated_at` = '2016-01-07 07:22:52' WHERE `id` = 1
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])