Angupriya/task4/firstwebpage/app/controllers/comments_controller.rb

SELECT * FROM `counters` WHERE (`counters`.`id` = 1)
---
  def new
  	@counter= Counter.find(params[:counter_id])

SELECT * FROM `counters` WHERE (`counters`.`id` = 1)
---
  def index
    @count=Counter.find(params[:counter_id])

SELECT * FROM `counters` WHERE (`counters`.`id` = 1)
INSERT INTO `comments` (`name`, `feedback`, `created_at`, `updated_at`, `counter_id`) VALUES('angu', 'skndmx c kjscnxkjcn', '2016-02-01 09:53:04', '2016-02-01 09:53:04', 29)
---
  def create
   @counter = Counter.find(params[:counter_id])
   @comment=@counter.comments.build(:name=>current_user.name,:feedback=>params[:comment][:feedback])

   if @comment.save

SELECT * FROM `counters` WHERE (`counters`.`id` = 1)
SELECT * FROM `comments` WHERE (`comments`.counter_id = 1) LIMIT 0, 5
SELECT count(*) AS count_all FROM `comments` WHERE (`comments`.counter_id = 1)
---
  def show
  @count=Counter.find(params[:counter_id])
  @comments=@count.comments.paginate(:page => params[:page],:per_page => 2)