Angupriya/task4/firstwebpage/app/controllers/counters_controller.rb

SELECT * FROM `counters`
---
  def index
    @counters = Counter.all

INSERT INTO `counters` (`content`, `name`, `created_at`, `count`, `updated_at`) VALUES('info about the country', '6th link', '2016-01-18 12:31:33', NULL, '2016-01-18 12:31:33')
---
  def create
  @counter = Counter.new(params[:counter])
    if @counter.save