Angupriya/task4/firstwebpage/app/controllers/link_with_titles_controller.rb

  def show
    @counter = LinkWithTitle.find(params[:id])
    @counter.count_value
    @total = Counter.all
---
SELECT * FROM `counters` WHERE (`counters`.`id` = 24) AND ( (`counters`.`type` = 'LinkWithTitle' ) )
SELECT sum(`counters`.count) AS sum_count FROM `counters`