Angupriya/task4/firstwebpage/app/controllers/link_without_titles_controller.rb

SELECT * FROM `counters` WHERE (`counters`.`id` = 22)
SELECT * FROM `counters`
SELECT sum(`counters`.count) AS sum_count FROM `counters`
---
  def show
   @counter = Counter.find(params[:id])
   @counter.count_value
   @total = Counter.all