Angupriya/task4/firstwebpage/app/controllers/users_controller.rb

	def create
	@user=User.new(params[:user])
		if @user.save
---
INSERT INTO `users` (`updated_at`, `name`, `password`, `created_at`) VALUES('2016-01-22 06:01:44', 'gokula', 'vani', '2016-01-22 06:01:44')