Ramesh/task_6_angular_js/app/controllers/details_controller.rb

  def index
    @details = Detail.all
---
SELECT * FROM `details`

  def show
    @detail = Detail.find(params[:id])
---
SELECT * FROM `details` WHERE (`details`.`id` = 1)

  def edit
    @detail = Detail.find(params[:id])
---
SELECT * FROM `details` WHERE (`details`.`id` = 1)

  def create
    @detail = Detail.new(params[:detail])

    respond_to do |format|
      if @detail.save
---
INSERT INTO `details` (`name`, `created_at`, `updated_at`) VALUES('jkdbskjahdre ajrsb', '2016-03-07 07:03:50', '2016-03-07 07:03:50')

  def update
    @detail = Detail.find(params[:id])

    respond_to do |format|
      if @detail.update_attributes(params[:detail])
---
SELECT * FROM `details` WHERE (`details`.`id` = 1)
UPDATE `details` SET `updated_at` = '2016-03-08 06:59:50', `name` = 'abcrara' WHERE `id` = 2

  def destroy
    @detail = Detail.find(params[:id])
    @detail.destroy
---
SELECT * FROM `details` WHERE (`details`.`id` = 1)
DELETE FROM `details` WHERE `id` = 1