Ramesh/task_5/app/controllers/comments_controller.rb

  def index
    @country = Country.find(params[:country_id])
    @comments = @country.comments.paginate( :page => params[:page], :per_page => 5)
---
SELECT * FROM `countries` WHERE (`countries`.`id` = 2)
SELECT * FROM `comments` WHERE (`comments`.country_id = 1) LIMIT 0, 2
SELECT * FROM `countries` LIMIT 0, 2
SELECT count(*) AS count_all FROM `comments` WHERE (`comments`.country_id = 1)
SELECT count(*) AS count_all FROM `countries`

  def show
  	@country = Country.find(params[:country_id])
  	@comment = @country.comments.find(params[:id])
---
SELECT * FROM `countries` WHERE (`countries`.`id` = 1)
SELECT * FROM `comments` WHERE (`comments`.`id` = 1 AND (`comments`.country_id = 1))

  def new
  	@country = Country.find(params[:country_id])
---
SELECT * FROM `countries` WHERE (`countries`.`id` = 1)

  def create
  	@country = Country.find(params[:country_id])
    @comment = @country.comments.build(:name => current_user.username, :commentbody => params[:comment][:commentbody])
  	if @comment.save
---
SELECT * FROM `countries` WHERE (`countries`.`id` = 1)
INSERT INTO `comments` (`country_id`, `name`, `commentbody`, `updated_at`, `created_at`) VALUES(3, 'Ramesh', 'UUUUUUUSSSSSSSSSSSAAAAAAAAAA!....', '2016-01-18 07:21:50', '2016-01-18 07:21:50')