Ramesh/task_5/app/controllers/countries_controller.rb

SELECT * FROM `countries`
---
  def index
  	@country = Country.all

SELECT * FROM `countries` WHERE (`countries`.`id` = 1)
UPDATE `countries` SET `updated_at` = '2016-01-18 11:39:08', `clickcount` = 124 WHERE `id` = 1
---
  def show
  	@country = Country.find(params[:id])
    @country.clickcount = @country.clickcount+1
    @country.save

INSERT INTO `countries` (`clickcount`, `countrydesc`, `countryname`, `updated_at`, `created_at`) VALUES(0, 'Ancient China was one of the first civilizations and was active since the 2nd millennium BC as a feudal society. Chinese civilization was also one of the few to invent writing', 'China', '2016-01-18 07:51:15', '2016-01-18 07:51:15')
---
  def create
  	@country = Country.new(params[:country])
  	@country.save