Ramesh/task_5/app/controllers/users_controller.rb

INSERT INTO `users` (`updated_at`, `password`, `created_at`, `username`) VALUES('2016-01-25 07:50:33', '2b24d495052a8ce66358eb576b8912c8', '2016-01-25 07:50:33', 'Ram')
---
  def create
    @user = User.new
    @user.username = params[:username]
    @user.password = params[:password]
    if @user.save